print("  быки   |   коровы    |    телята")
for bulls in range(0, 11):
    # Перебираем возможное количество коров (от 0 до 20, т.к. 5*20=100)
    for cows in range(0, 21):
        # Перебираем возможное количество телят (от 0 до 200, т.к. 0.5*200=100)
        for calves in range(0, 201):
            # Проверяем условие: сумма равна 100 рублей и куплено хотя бы одно животное
            if (bulls * 10 + cows * 5 + calves * 0.5 == 100) and (bulls + cows + calves >= 1):
                print(f"{bulls:^8} | {cows:^11} | {calves:^12}")